# A sub-Brewfile that is aggregated into the main Brewfile.
# It is assumed this sub-Brewfile resides in the same directory as the main Brewfile.

# This sub-Brewfile is dedicated to Homebrew Formulae = Homebrew packages 
# (CLI tools, libs, daemons) installed in the Cellar.

brew "bash"                    # Bourne-Again SHell, a UNIX command interpreter
brew "bat"                     # Clone of cat(1) with syntax highlighting and Git integration
brew "coreutils"               # basic file, shell and text manipulation utilities
brew "dockutil"                # Tool for configuring the items in a macOS Dock
brew "eza"                     # Modern alternative to `ls`
brew "fastfetch"               # Displays system information (replacement for neofetch)
brew "fd"                      # Simple, fast, and user-friendly alternative to find
brew "fresh-editor"            # Rust-based text editor
brew "fzf"                     # Command-line fuzzy finder
brew "gh"                      # GitHub command-line tool
brew "git"                     # Distributed revision-control system
brew "jq"                      # Lightweight and flexible command-line JSON processor
                                 # REQUIRED: Used by GenoMac to create volumes and user accounts
brew "mas"                     # Mac App Store command-line interface
                                 # REQUIRED: Used by GenoMac (via Homebrew) to install MAS apps
brew "node"                    # Also known as: node.js, node@24, nodejs, npm
                                 # Required for Alfred’s “Proper Title Case” workflow.
brew "php"                     # General-purpose scripting language
                                 # Required for Alfred’s “Text Actions” workflow.
brew "ripgrep"                 # Search tool like, but better than, grep and the Silver Searcher
brew "starship"                # Configures prompt for Zsh and other shells
brew "stockfish"               # Strong open-source chess engine
brew "stow"                    # Symlink-farm manager, used for deploying symlinks of 
                                 # dotfiles to $HOME
                                 # REQUIRED: Manages dotfiles for Project GenoMac
brew "tlrc"                    # tldr (alternative to man pages) client written in Rust
brew "trash"                   # CLI tool that moves files or folders to the trash
brew "typst"                   # Markup-based typesetting system
brew "uv"                      # Python package and project manager
brew "zoxide"                  # A smarter `cd` command
# brew "zsh"                     # Default UNIX shell (command interpreter)
                                 # Homebrew’s Zsh appears to cause trouble for non–Homebrew installer users

# brew "zsh-autocomplete"        # Real-time type-ahead completion for Zsh
                                 # Not loading this now.

brew "zsh-autosuggestions"     # Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-syntax-highlighting" # Fish-shell-like syntax highlighting for zsh
